i1 = 2
i2 = 5
i3 = -3
d1 = 2.0
d2 = 5.0
d3 = -0.5
print("a =", i1 + (i2 * i3))
# a = 2 + (5 * -3) = -13, nhân trước, rồi cộng.
print("b =", i1 * (i2 + i3))
# b = 2 * (5 + -3) = 4, cộng trong ngoặc trước.
print("c =", i1 / (i2 + i3))
# c = 2 / (5 + -3) = 1.0, phép chia / luôn ra float.
print("d =", i1 // (i2 + i3))
# d = 2 // (5 + -3) = 1, // là chia lấy nguyên.
print("e =", i1 / i2 + i3)
# e = (2 / 5) + -3 = -2.6
print("f =", i1 // i2 + i3)
# f = (2 // 5) + -3 = -3
print("g =", 3 + 4 + 5 / 3)
# g = 3 + 4 + (5 / 3) = 8.666...
print("h =", 3 + 4 + 5 // 3)
# h = 3 + 4 + (5 // 3) = 8
print("i =", (3 + 4 + 5) / 3)
# i = (3 + 4 + 5) / 3 = 4.0
print("j =", (3 + 4 + 5) // 3)
# j = (3 + 4 + 5) // 3 = 4
print("k =", d1 + (d2 * d3))
# k = 2.0 + (5.0 * -0.5) = -0.5
print("l =", d1 + d2 * d3)
# l = 2.0 + 5.0 * -0.5 = -0.5, giống (k), vì nhân chia ưu tiên hơn cộng.
print("m =", d1 / d2 - d3)
# m = (2.0 / 5.0) - (-0.5) = 0.9,
print("n =", d1 / (d2 - d3))
# n = 2.0 / (5.0 + 0.5) = ~0.3636
print("o =", d1 + d2 + d3 / 3)
# o = 2.0 + 5.0 + (-0.5 / 3) = ~6.83
print("p =", (d1 + d2 + d3) / 3)
# p = (2.0 + 5.0 - 0.5) / 3 = ~2.17
print("q =", d1 + d2 + (d3 / 3))
# q = 2.0 + 5.0 + (-0.5 / 3) = ~6.83, giống (o), chỉ khác cách viết.
print("r =", 3 * (d1 + d2) * (d1 - d3))
# r = 3 * (2.0 + 5.0) * (2.0 + 0.5) = 52.5